# RoomCoefficientUtilizationWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..IlluminationFailures..::..RoomCoefficientUtilizationWarning Property
BuiltInFailures..::..IlluminationFailures Class See Also
---
Estimated Illumination failed. Coefficient of utilization not set for lighting fixture.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomCoefficientUtilizationWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomCoefficientUtilizationWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomCoefficientUtilizationWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..IlluminationFailures Class
Autodesk.Revit.DB Namespace